<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 北邮青年 自定义设定(根据甲方要求改变)
    |--------------------------------------------------------------------------
    */
    
    /*-----------------------------------------------------------------------*\
    | 活动相关 
    \*-----------------------------------------------------------------------*/
    
    //只有活动发布者才能编辑活动信息
    'update_activity_only_creator' => 0, 
    //只有活动发布者才能删除该活动
    'delete_activity_only_creator' => 0, 
    
    /*-----------------------------------------------------------------------*\
    | 评论/反馈相关 
    \*-----------------------------------------------------------------------*/
    
    //活动结束后才能提交反馈
    'comment_only_activity_ends' => 0,
    //参加活动者才可以提交反馈
    'comment_only_signed' => 1,
    //活动反馈公开给:所有用户2 参加活动的用户1 仅活动发布者0
    'public_comments' => 2,
    
    //评论是否需要审核
    'comment_moderation' => 0,
    //评论作者是否可以编辑自己的评论
    'comment_modifiable' => 0, 
    //评论作者是否可以删除自己的评论
    'comment_deletable' => 0, 
    
    /*-----------------------------------------------------------------------*\
    | 用户相关 
    \*-----------------------------------------------------------------------*/
    
    //个人主页是否显示其发布的活动
    'userpage_show_activity_created' => 1,
    //个人主页是否展示其参与的活动
    'userpage_show_activity_participated' => 1,

];
